Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridOutOfOrder Property
 Curtain wall grid lines have changed order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridOutOfOrder { get; }
Public Shared ReadOnly Property GridOutOfOrder As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridOutOfOrder {
	FailureDefinitionId^ get ();
}
static member GridOutOfOrder : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace